/**********************************************************************************************
*小A有一张半径为r的圆桌，其中心位于(x,y)，现在他想把圆桌的中心移到(x1, y1)。每次移动一步，小A *
*都得在圆桌边界上固定一个点，然后将圆桌绕这个点旋转。 问最少需要几步才能把圆桌移到目标位置？  *
***********************************************************************************************/
#include<stdio.h>
#include<math.h>

int main(void) {
    int r, x, y, x1, y1;
    double distance=0;
    int result;
    
    scanf("%d%d%d%d%d", &r, &x, &y, &x1, &y1);
    
    distance = sqrt((x-x1)*(x-x1) + (y-y1)*(y-y1));
    result = (int) ceil (distance/(2*r));
    
    printf("%d", result);
    return 0;
}

